Импорт библиотек

In [2]:
import numpy as np
import pandas as pd

Считывание данных

In [5]:
data = pd.read_csv('athlete_events.csv')

In [7]:
type(data)

pandas.core.frame.DataFrame

Обзор данных

In [8]:
data.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [9]:
data.tail()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

In [10]:
data.shape

(271116, 15)

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [12]:
data.describe()

,ID,Age,Height,Weight,Year
count,271116.000000,261642.000000,210945.000000,208241.000000,271116.000000
mean,68248.954396,25.556898,175.338970,70.702393,1978.378480
std,39022.286345,6.393561,10.518462,14.348020,29.877632
min,1.000000,10.000000,127.000000,25.000000,1896.000000
25%,34643.000000,21.000000,168.000000,60.000000,1960.000000
50%,68205.000000,24.000000,175.000000,70.000000,1988.000000
75%,102097.250000,28.000000,183.000000,79.000000,2002.000000
max,135571.000000,97.000000,226.000000,214.000000,2016.000000

Индексация (выбор столбцов)

In [13]:
data['Name'].head()

0                   A Dijiang
1                    A Lamusi
2         Gunnar Nielsen Aaby
3        Edgar Lindenau Aabye
4    Christine Jacoba Aaftink
Name: Name, dtype: object

In [14]:
data['City'].tail(3)

271113             Sochi
271114            Nagano
271115    Salt Lake City
Name: City, dtype: object

LOC и ILOC

In [15]:
data.loc[15:25, ['Name', 'Medal']]

               Name Medal
15  Per Knut Aaland   NaN
16  Per Knut Aaland   NaN
17  Per Knut Aaland   NaN
18     John Aalberg   NaN
19     John Aalberg   NaN
20     John Aalberg   NaN
21     John Aalberg   NaN
22     John Aalberg   NaN
23     John Aalberg   NaN
24     John Aalberg   NaN
25     John Aalberg   NaN

In [16]:
data.iloc[26:33,3:6]

     Age  Height  Weight
26  18.0   168.0     NaN
27  18.0   168.0     NaN
28  26.0   186.0    96.0
29  26.0     NaN     NaN
30  22.0   182.0    76.5
31  31.0   172.0    70.0
32  30.0   159.0    55.5

Логическая индексация (поиск в данных)

In [17]:
data[data['Medal'] == 'Gold']['Age'].max(), \
data[data['Medal'] == 'Gold']['Age'].min()

(64.0, 13.0)

In [18]:
data[data['Medal'] == 'Gold']['Age'].mean(), \
data[data['Medal'] == 'Silver']['Age'].mean(), \
data[data['Medal'] == 'Bronze']['Age'].mean()

(25.901013309134907, 25.99672412448327, 25.879209595571275)

In [19]:
data[(data['Medal'] == 'Gold') & (data['Team'] == 'Russia')]['Age'].mean(), \
data[(data['Medal'] == 'Silver') & (data['Team'] == 'Russia')]['Age'].mean(), \
data[(data['Medal'] == 'Bronze') & (data['Team'] == 'Russia')]['Age'].mean()

(25.128415300546447, 25.385714285714286, 25.959287531806616)

In [20]:
data[(data['Age'] == data[data['Medal'] == 'Gold']['Age'].max()) & (data['Medal'] == 'Gold')]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
105199,53238,Charles Jacobus,M,64.0,NaN,NaN,United States,USA,1904 Summer,1904,Summer,St. Louis,Roque,Roque Men's Singles,Gold
233390,117046,Oscar Gomer Swahn,M,64.0,NaN,NaN,Sweden,SWE,1912 Summer,1912,Summer,Stockholm,Shooting,"Shooting Men's Running Target, Single Shot, Team",Gold

Запросы (query)

In [21]:
q = '(Year == 2008) & (Sex == "M") & (Sport == "Football")'
data.query(q).head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
198,92,Ignazio Abate,M,21.0,180.0,73.0,Italy,ITA,2008 Summer,2008,Summer,Beijing,Football,Football Men's Football,NaN
1276,716,Lautaro Germn Acosta,M,20.0,168.0,72.0,Argentina,ARG,2008 Summer,2008,Summer,Beijing,Football,Football Men's Football,Gold
1296,729,Robert Acquafresca,M,20.0,184.0,70.0,Italy,ITA,2008 Summer,2008,Summer,Beijing,Football,Football Men's Football,NaN
1617,896,Olubayo Adefemi,M,22.0,181.0,82.0,Nigeria,NGR,2008 Summer,2008,Summer,Beijing,Football,Football Men's Football,Silver
1637,908,"Ayodele ""Dele"" Adeleye",M,19.0,190.0,80.0,Nigeria,NGR,2008 Summer,2008,Summer,Beijing,Football,Football Men's Football,Silver

In [22]:
q = '(Team == "Russia") & (Age < 18) & (Medal == "Gold")'
data.query(q).shape[0]

16

In [23]:
data.query(q).head(3)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
4835,2762,Margarita Sergeyevna Aliychuk,F,17.0,174.0,48.0,Russia,RUS,2008 Summer,2008,Summer,Beijing,Rhythmic Gymnastics,Rhythmic Gymnastics Women's Group,Gold
59345,30394,Kseniya Pavlovna Dudkina,F,17.0,173.0,49.0,Russia,RUS,2012 Summer,2012,Summer,London,Rhythmic Gymnastics,Rhythmic Gymnastics Women's Group,Gold
80233,40719,Olga Vyacheslavovna Glatskikh,F,15.0,170.0,50.0,Russia,RUS,2004 Summer,2004,Summer,Athina,Rhythmic Gymnastics,Rhythmic Gymnastics Women's Group,Gold

In [24]:
data.query(q).Age.mean()

16.625

Группировка (GroupBy)

In [25]:
data.groupby('Sex')['Age', 'Height', 'Weight'].count()

C:\Users\VivoBook\AppData\Local\Temp\ipykernel_12432\2513299922.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby('Sex')['Age', 'Height', 'Weight'].count()

        Age  Height  Weight
Sex
F     74098   67378   66771
M    187544  143567  141470

In [26]:
data.groupby('Sex')['Age', 'Height', 'Weight'].agg(np.mean)

C:\Users\VivoBook\AppData\Local\Temp\ipykernel_12432\882628716.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby('Sex')['Age', 'Height', 'Weight'].agg(np.mean)

           Age      Height     Weight
Sex
F    23.732881  167.839740  60.021252
M    26.277562  178.858463  75.743677

In [27]:
data.groupby('Sex')['Age', 'Height', 'Weight'].agg(np.max)

C:\Users\VivoBook\AppData\Local\Temp\ipykernel_12432\4203646352.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  data.groupby('Sex')['Age', 'Height', 'Weight'].agg(np.max)

      Age  Height  Weight
Sex
F    74.0   213.0   167.0
M    97.0   226.0   214.0

Сводная таблица (CrossTab)

In [28]:
pd.crosstab(data[data['Age'] < 18]['Age'], data['Medal'])

Medal  Bronze  Gold  Silver
Age
10.0        1     0       0
11.0        0     0       1
12.0        3     0       3
13.0        2     7       7
14.0       18    27      30
15.0       54    75      67
16.0      105   116     129
17.0      172   199     163

In [29]:
pd.crosstab(data['Team'], data['Medal']).head(3)

Medal                  Bronze  Gold  Silver
Team
A North American Team       4     0       0
Afghanistan                 2     0       0
Algeria                     8     5       4

Добавление новых столбцов (построение признаков)

In [30]:
#data['Event'].unique()

In [31]:
data['good_walk'] = ((data['Height'] > 180) & \
                         (data['Weight'] < 75) & \
                         (data['Event'] == "Athletics Men's 50 kilometres Walk")).astype('int8')

In [32]:
data[data['good_walk'] == 1].head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,good_walk
1482,824,Luke Kendall Adams,M,31.0,189.0,70.0,Australia,AUS,2008 Summer,2008,Summer,Beijing,Athletics,Athletics Men's 50 kilometres Walk,NaN,1
1483,824,Luke Kendall Adams,M,35.0,189.0,70.0,Australia,AUS,2012 Summer,2012,Summer,London,Athletics,Athletics Men's 50 kilometres Walk,NaN,1
6638,3716,Erling Andersen,M,23.0,182.0,65.0,Norway,NOR,1984 Summer,1984,Summer,Los Angeles,Athletics,Athletics Men's 50 kilometres Walk,NaN,1
6640,3716,Erling Andersen,M,27.0,182.0,65.0,Norway,NOR,1988 Summer,1988,Summer,Seoul,Athletics,Athletics Men's 50 kilometres Walk,NaN,1
11717,6394,Per Olav Baarnaas,M,28.0,182.0,66.0,Norway,NOR,1948 Summer,1948,Summer,London,Athletics,Athletics Men's 50 kilometres Walk,NaN,1

Map & Apply

In [33]:
d =  {1: 'good', 0: 'not-good'}

In [34]:
data[data['good_walk'] == 1]['good_walk'].map(d).head()

1482     good
1483     good
6638     good
6640     good
11717    good
Name: good_walk, dtype: object

In [35]:
data['Year'].apply(lambda x: 'new' if x > 2007 else 'old').head()

0    old
1    new
2    old
3    old
4    old
Name: Year, dtype: object